Revit 2027 API
SpecTypeId.PipingFriction Property
 Friction, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingFriction { get; }
Public Shared ReadOnly Property PipingFriction As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingFriction {
	ForgeTypeId^ get ();
}
static member PipingFriction : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace